app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all, :include => :user, :order => "created_at DESC")
---
SELECT * FROM "users" WHERE ("users"."id" IN (2,1))

  def create
    @post = Post.new(params[:post])
    @post.save!
---
INSERT INTO "posts" ("title", "created_at", "updated_at", "user_id", "content") VALUES('test', '2014-03-07 06:53:24', '2014-03-07 06:53:24', 18, '听林姐说这回新加的组是要做web即时聊天的