app/controllers/posts_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "name") VALUES('2014-03-07 03:05:54', '2014-03-07 03:05:54', 'banban')
---
  def create
    @post = current_group.posts.new(params[:post])
    @post.user_id = current_user.id
    @post.school_id = current_user.school_id
    @post.save!